trade_exp/src/Catalogs/КартыЛояльности/КартыЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КартыЛояльности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.ВидыКартЛояльности</owners>
  <attributes>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>МагнитныйКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Catalogs/КартыЛояльности/Forms/ПомощникРегистрации/Module.bsl
&НаСервере

Функция ЗаписатьЗначениеДопСведения(Объект, Свойство, Значение)
    Попытка
        НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();

        НаборЗаписей.Отбор.Объект.Установить(Объект);
        НаборЗаписей.Отбор.Свойство.Установить(Свойство);

        НоваяСтрокаНабора = НаборЗаписей.Добавить();

        НоваяСтрокаНабора.Объект = Объект;
        НоваяСтрокаНабора.Свойство = Свойство;

        НоваяСтрокаНабора.Значение = Значение;

        НаборЗаписей.Записать();

        Возврат Истина;
    Исключение
        Возврат Ложь;
    КонецПопытки;
КонецФункции


&После("ГотовоНаСервере")
Процедура КЛ_ГотовоНаСервере()
		  
		  ДатаРег = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Дата регистрации новой карты");	
		  ТекКарта = НоваяКарта.Ссылка;
		  ЗаписатьЗначениеДопСведения(ТекКарта, ДатаРег, ТекущаяДата());
		  
		  ТекПольз = АльтерраОбщегоНазначения.ТекущийПользователь();
		  Если ТекПольз <> Справочники.Пользователи.ПустаяСсылка() Тогда 
		      ЗаписатьЗначениеДопСведения(
			  	ТекКарта, 
				ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Менеджер, выдавший новую карту"), 
				ТекПольз);
		  КонецЕсли;
		  
		  //Бригадиры
		  Если АльтерраОбщегоНазначения.ЭтоБригадир(Партнер) и Партнер.ПИН_Код = "" тогда
              АльтерраОбщегоНазначения.СгенерироватьПИНПартнера(Партнер.Код);
			   //Отправляем СМС с кодом
              НТелефона = АльтерраОбщегоНазначения.ПолучитьТелефонПартнера(Партнер);
			  Если НТелефона<>"" Тогда
			   АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(НТелефона);
			   НомераТелефонов = Новый Массив;
               НомераТелефонов.Добавить("+7"+НТелефона);
               ТекстСообщения = "Ваш пароль для списания бонусов - " + Партнер.ПИН_Код + ". Варианты сотрудничества https://tg-alterra.ru/stroiklub/professional_authorized";
               ОтправкаSMS.ОтправитьSMS(НомераТелефонов,ТекстСообщения,,);
			  //Иначе 
			  //  ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Бонусная карта создана, но СМС с ПИН-кодом не отправлена, т.к. у партнера не задан номер телефона",,)
			  КонецЕсли; 
		  Конецесли; 
		  //Бригадиры.
КонецПроцедуры
